benchmarks/results/pairs/encore/encore-mixed-2.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/bench.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * mixed: 50 looping VUs for 30s (exec: mixed, gracefulStop: 10s)


running (01.0s), 50/50 VUs, 417 complete and 0 interrupted iterations
mixed   [   3% ] 50 VUs  01.0s/30s

running (02.0s), 50/50 VUs, 753 complete and 0 interrupted iterations
mixed   [   7% ] 50 VUs  02.0s/30s

running (03.0s), 50/50 VUs, 1192 complete and 0 interrupted iterations
mixed   [  10% ] 50 VUs  03.0s/30s

running (04.0s), 50/50 VUs, 1536 complete and 0 interrupted iterations
mixed   [  13% ] 50 VUs  04.0s/30s

running (05.0s), 50/50 VUs, 1797 complete and 0 interrupted iterations
mixed   [  17% ] 50 VUs  05.0s/30s

running (06.0s), 50/50 VUs, 2133 complete and 0 interrupted iterations
mixed   [  20% ] 50 VUs  06.0s/30s

running (07.0s), 50/50 VUs, 2554 complete and 0 interrupted iterations
mixed   [  23% ] 50 VUs  07.0s/30s

running (08.0s), 50/50 VUs, 3065 complete and 0 interrupted iterations
mixed   [  27% ] 50 VUs  08.0s/30s

running (09.0s), 50/50 VUs, 3468 complete and 0 interrupted iterations
mixed   [  30% ] 50 VUs  09.0s/30s

running (10.0s), 50/50 VUs, 3881 complete and 0 interrupted iterations
mixed   [  33% ] 50 VUs  10.0s/30s

running (11.0s), 50/50 VUs, 4327 complete and 0 interrupted iterations
mixed   [  37% ] 50 VUs  11.0s/30s

running (12.0s), 50/50 VUs, 4682 complete and 0 interrupted iterations
mixed   [  40% ] 50 VUs  12.0s/30s

running (13.0s), 50/50 VUs, 5117 complete and 0 interrupted iterations
mixed   [  43% ] 50 VUs  13.0s/30s

running (14.0s), 50/50 VUs, 5437 complete and 0 interrupted iterations
mixed   [  47% ] 50 VUs  14.0s/30s

running (15.0s), 50/50 VUs, 5795 complete and 0 interrupted iterations
mixed   [  50% ] 50 VUs  15.0s/30s

running (16.0s), 50/50 VUs, 6224 complete and 0 interrupted iterations
mixed   [  53% ] 50 VUs  16.0s/30s

running (17.0s), 50/50 VUs, 6572 complete and 0 interrupted iterations
mixed   [  57% ] 50 VUs  17.0s/30s

running (18.0s), 50/50 VUs, 6926 complete and 0 interrupted iterations
mixed   [  60% ] 50 VUs  18.0s/30s

running (19.0s), 50/50 VUs, 7291 complete and 0 interrupted iterations
mixed   [  63% ] 50 VUs  19.0s/30s

running (20.0s), 50/50 VUs, 7619 complete and 0 interrupted iterations
mixed   [  67% ] 50 VUs  20.0s/30s

running (21.0s), 50/50 VUs, 7896 complete and 0 interrupted iterations
mixed   [  70% ] 50 VUs  21.0s/30s

running (22.0s), 50/50 VUs, 8241 complete and 0 interrupted iterations
mixed   [  73% ] 50 VUs  22.0s/30s

running (23.0s), 50/50 VUs, 8562 complete and 0 interrupted iterations
mixed   [  77% ] 50 VUs  23.0s/30s

running (24.0s), 50/50 VUs, 8892 complete and 0 interrupted iterations
mixed   [  80% ] 50 VUs  24.0s/30s

running (25.0s), 50/50 VUs, 9267 complete and 0 interrupted iterations
mixed   [  83% ] 50 VUs  25.0s/30s

running (26.0s), 50/50 VUs, 9589 complete and 0 interrupted iterations
mixed   [  87% ] 50 VUs  26.0s/30s

running (27.0s), 50/50 VUs, 9907 complete and 0 interrupted iterations
mixed   [  90% ] 50 VUs  27.0s/30s

running (28.0s), 50/50 VUs, 10281 complete and 0 interrupted iterations
mixed   [  93% ] 50 VUs  28.0s/30s

running (29.0s), 50/50 VUs, 10612 complete and 0 interrupted iterations
mixed   [  97% ] 50 VUs  29.0s/30s

running (30.0s), 50/50 VUs, 10885 complete and 0 interrupted iterations
mixed   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 21872   725.716669/s
    checks_succeeded...: 100.00% 21872 out of 21872
    checks_failed......: 0.00%   0 out of 21872

    ✓ status ok
    ✓ has data

    CUSTOM
    failed_requests................: 0.00%  0 out of 10936
    ttfb...........................: avg=123.64ms min=4.46ms  med=126.73ms max=235.33ms p(90)=165.53ms p(95)=183.47ms

    HTTP
    http_req_duration..............: avg=137.12ms min=19.79ms med=137.97ms max=271.44ms p(90)=180.22ms p(95)=197.95ms
      { expected_response:true }...: avg=137.12ms min=19.79ms med=137.97ms max=271.44ms p(90)=180.22ms p(95)=197.95ms
    http_req_failed................: 0.00%  0 out of 10936
    http_reqs......................: 10936  362.858335/s

    EXECUTION
    iteration_duration.............: avg=137.41ms min=19.95ms med=138.24ms max=271.86ms p(90)=180.54ms p(95)=198.41ms
    iterations.....................: 10936  362.858335/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 57 MB  1.9 MB/s
    data_sent......................: 1.8 MB 61 kB/s



running (30.1s), 00/50 VUs, 10936 complete and 0 interrupted iterations
mixed ✓ [ 100% ] 50 VUs  30s